hurrican/wita-acceptance-test/src/citrus/resources/templates/cdm/v1/TAL_BEREIT_NEU_26/ABBM.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--Note: This file is generated by CDM transformation tool - do not modify this file manually!-->
<SOAP-ENV:Envelope
        xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderNotificationService/v1"
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <notifyUpdateOrder>
            <order>
                <geschaeftsfall>NEU</geschaeftsfall>
                <aenderungsKennzeichen>Terminverschiebung</aenderungsKennzeichen>
                <geschaeftsfallart>Bereitstellung</geschaeftsfallart>
            </order>
            <message>
                <ABBM>
                    <meldungsattribute>
                        <vertragsnummer>${contractId}</vertragsnummer>
                        <externeAuftragsnummer>@ignore@</externeAuftragsnummer>
                        <kundennummer>${customerId}</kundennummer>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>1020</meldungscode>
                            <meldungstext>Das Zeitfenster ist nicht vereinbart.</meldungstext>
                        </position>
                    </meldungspositionen>
                </ABBM>
            </message>
            <captured>citrus:currentDate(yyyy-MM-dd'T'HH:mm:ss)</captured>
        </notifyUpdateOrder>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
